performance-tests/artillery_config.yml
config:
  target: "https://8d6b-175-107-236-228.ngrok-free.app/api/v1"
  phases:
    - duration: 60
      arrivalRate: 5
      name: "Warm up"
    - duration: 120
      arrivalRate: 5
      rampTo: 50
      name: "Stage 2: Heavy Load"
    - duration: 300
      arrivalRate: 100
      name: "Stage 3: High Traffic"
    - duration: 600
      arrivalRate: 500
      name: "Stage 4: Surge"
  
  defaults:
    headers:
      Content-Type: "application/json"

scenarios:
  - name: "Full User Journey"
    flow:
      # 1. App Open
      - get:
          url: "/categories"
      - get:
          url: "/products"
      - think: 2

      # 2. Browsing
      - get:
          url: "/products"
          capture:
            json: "$[0].id"
            as: "productId"
      - get:
          url: "/products/{{ productId }}"
      - think: 3

      # 3. Authentication (Mocked)
      - post:
          url: "/auth/verify-otp"
          json:
            phoneNumber: "+923001234567"
            otpCode: "123456"
          capture:
            json: "$.accessToken"
            as: "token"
      
      # 4. Shopping
      - post:
          url: "/cart/add"
          headers:
            Authorization: "Bearer {{ token }}"
          json:
            productId: "{{ productId }}"
            quantity: 1
          capture:
            json: "$.items[0].id"
            as: "cartItemId"
      - think: 2

      # 5. Checkout
      - post:
          url: "/orders/checkout"
          headers:
            Authorization: "Bearer {{ token }}"
          json:
            addressId: "f03014c2-9caf-4796-abf3-7e487920bc9d"
            paymentMethod: "cash_on_delivery"
          capture:
            json: "$.id"
            as: "orderId"
      - think: 5

      # 6. Tracking
      - get:
          url: "/orders/{{ orderId }}"
          headers:
            Authorization: "Bearer {{ token }}"
      - think: 10

      # 7. Cancel
      - post:
          url: "/orders/{{ orderId }}/cancel"
          headers:
            Authorization: "Bearer {{ token }}"